// 1. optional chaining
// student.marks?.math

// must know
// 2.map, filter, find

// 3. (optional): forEach, reduce (advanced)

// 4. class

// 5. (optional) inheritance, super

// 6. (must know): prototypical Inheritance


/*
আজকে কোন কোন জিনিস খেয়াল করবে 

১. nested অবজেক্ট (অর্থাৎ একটা অবজেক্ট এর প্রপার্টি এর মধ্যেও যে অবজেক্ট থাকতে পারে। আবার সেই অবজেক্ট এর প্রপার্টি এর মধ্যেও যে অবজেক্ট থাকতে পারে। সেটা খেয়াল করতে হবে )

২. ডট এর আগে যে প্রশ্নবোধক চিহ্ন দিয়ে যে অপশনাল চেইনিং করা যায়। সেটা একটু খেয়াল করতে হবে। 



যে জিনিসগুলা এখন না লাগলেও দুই-তিন সপ্তাহ পরে লাগবে। তখন আবার এই জিনিসগুলো নিয়ে আলোচনা করবো। তবে এখন একটু দেখে রাখলে তখন ইজি লাগবে। 

৩. array এর মধ্যে map কিভাবে করতে হয়। 

৪. array এর মধ্যে forEach কিভাবে করে। এবং map এর forEach এর মধ্যে ডিফারেন্স কি

৫. filter জিনিসটা দিয়ে কি করা হয়। ফিল্টার যে array রিটার্ন করে সেটা ফিউচারের জন্য খেয়াল রাখতে হবে 

৬. find এবং filter এর মধ্যে ডিফারেন্স কি ? 

৭. অবজেক্ট এর সিম্পল destructuring কিভাবে করে ?

৮. array এর সিম্পল destructuring কিভাবে করে ?

*/